In [1]:
import os
import pandas as pd
import numpy as np
import csv

In [2]:
file1 = "D:\\Bootcampclean_uber_2.csv"
file2 = "D:\\Bootcampclean_nta.csv"

In [3]:
types_dict = {'Date': 'object',
             'Time': 'object',
             'Month': 'int8',
             'Day': 'int8',
             'Year': 'int16',
             'locationID': 'int32',             
             'borough': 'object',
             'zone': 'object',             
             'service_zone': 'object',
             'ntacode': 'object',
             }

In [4]:
uber_df = pd.read_csv(file1, low_memory=True,dtype=types_dict)

nta_df=pd.read_csv(file2)

In [5]:
nta_df = nta_df[['ntacode','pickup_neighborhood']]
nta_df.head()

  ntacode      pickup_neighborhood
0    BX31  Allerton-Pelham Gardens
1    BX31  Allerton-Pelham Gardens
2    BX31  Allerton-Pelham Gardens
3    BX31  Allerton-Pelham Gardens
4    BX31  Allerton-Pelham Gardens

In [45]:
nta_df_nodupes = nta_df.drop_duplicates()

(195, 2)

In [6]:
uber_df.reset_index(drop=False).head()

,index,Unnamed: 0,Date,Time,Month,Day,Year,locationID,borough,zone,service_zone,ntacode
0,0,0,2015-05-17,09:47:00,5,17,2015,141,Manhattan,Lenox Hill West,Yellow Zone,MN31
1,1,1,2015-05-17,09:47:00,5,17,2015,65,Brooklyn,Downtown Brooklyn/MetroTech,Boro Zone,BK38
2,2,2,2015-05-17,09:47:00,5,17,2015,100,Manhattan,Garment District,Yellow Zone,MN13
3,3,3,2015-05-17,09:47:00,5,17,2015,80,Brooklyn,East Williamsburg,Boro Zone,BK90
4,4,4,2015-05-17,09:47:00,5,17,2015,90,Manhattan,Flatiron,Yellow Zone,MN13

In [7]:
uber_df=uber_df[['Date','Time','Month','Day','Year','locationID','borough','zone','service_zone','ntacode']]

In [47]:
uber_df.shape

(14270479, 10)

In [51]:
uber_nodupe_df = uber_df.dropna(axis=0, how='any')

In [52]:
uber_nodupe_df.shape

(14264215, 10)

In [53]:
uber_df_clean = uber_nodupe_df.merge(nta_df_nodupes, on='ntacode', how = 'left' )

In [55]:
uber_df_clean.head()

,Date,Time,Month,Day,Year,locationID,borough,zone,service_zone,ntacode,pickup_neighborhood
0,2015-05-17,09:47:00,5,17,2015,141,Manhattan,Lenox Hill West,Yellow Zone,MN31,Lenox Hill-Roosevelt Island
1,2015-05-17,09:47:00,5,17,2015,65,Brooklyn,Downtown Brooklyn/MetroTech,Boro Zone,BK38,DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hill
2,2015-05-17,09:47:00,5,17,2015,100,Manhattan,Garment District,Yellow Zone,MN13,Hudson Yards-Chelsea-Flat Iron-Union Square
3,2015-05-17,09:47:00,5,17,2015,80,Brooklyn,East Williamsburg,Boro Zone,BK90,East Williamsburg
4,2015-05-17,09:47:00,5,17,2015,90,Manhattan,Flatiron,Yellow Zone,MN13,Hudson Yards-Chelsea-Flat Iron-Union Square

In [56]:
unique_pickup = pd.DataFrame(uber_df_clean['pickup_neighborhood'].unique())

In [65]:
uber_df_clean.shape

(14264215, 11)

In [66]:
uber_df_clean_no_na = uber_df_clean.dropna(axis=0, how='any')

In [67]:
uber_df_clean_no_na.shape

(14264110, 11)

In [69]:
unique_pickup=unique_pickup.sort_values(by=0,ascending=True)

In [70]:
unique_pickup = unique_pickup.dropna(axis=0, how='any')

In [71]:
unique_pickup.shape

(189, 1)

In [74]:
unique_pickup.to_csv('unique_pickup_neighborhoods.csv')

In [73]:
path="D:\\Bootcamp"
uber_df_clean_no_na.to_csv(path+'uber_clean.csv')